rheoTool/tutorials/rheoMultiRegionFoam/sphere/PTTLog/constant/fluid.back/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{             

                type             PTTLog;

                rho              rho [1 -3 0 0 0 0 0] 0.005;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.5;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.5;             
                lambda           lambda [0 0 1 0 0 0 0] 5.;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.25;
                zeta             zeta [0 0 0 0 0 0 0] 0.; 
                
                destructionFunctionType  exponential;
               
                stabilization    coupling;                           
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
