rheoTool/tutorials/rheoMultiRegionFoam/sphere/PTTLog/constant/sphere.back/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

energySource
{
  type            semiImplicitSource;

  timeStart       0;
  duration        1e10;
  selectionMode   all;
  volumeMode      specific;
  sources
  {
    T
    {
          explicit 3;
          implicit 0;
    }
  }
}
 

// ************************************************************************* //
