rheoTool/tutorials/rheoMultiRegionFoam/sphere/PTTLog/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coupledSolvers
{  
  Uptau
  {
    solveCoupledUp false;
    solveCoupledTau false;
    
    saveSystem true;
    robustSumCheck  true;
    updatePrecondFrequency -1;  
    updateMatrixCoeffs true;   
  }
}

solvers
{
    "(T.*)"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-10;
        relTol           0.01;
        minIter          0;
        maxIter          800;
        
    }
    
    "(U.*)"
    {        
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0.001;
        minIter          0;
        maxIter          800;   
    }
    
    "(p_rgh.*)"
    {        
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol           0.001;
        minIter          0;
        maxIter          800;   
    }
    
    "(tau.*|theta.*)"
    {        
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-10;
        relTol           0.;
        minIter          0;
        maxIter          800;   
    }
}

PIMPLE
{
  frozenFlow false; 
  
  nInIter  1;
  nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    
}

// ************************************************************************* //
